performance/tsung/test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"  maxusers="10000"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="192.168.96.134" port="9000" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="myserver" type="snmp"></monitor>
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set8  
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="2" unit="minute">
     <users arrivalrate="18" unit="second"></users>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name='ifnul_tsung' probability='100'  type='ts_http'>

<transaction name="login_request">
<request><http url='http://192.168.96.134:9000/' version='1.1' if_modified_since='Thu, 01 Oct 2015 15:48:35 GMT' method='GET'></http></request>
<request><http url='http://192.168.96.134:9000/views/signin.html' version='1.1' if_modified_since='Thu, 01 Oct 2015 15:48:35 GMT' method='GET'></http></request>
</transaction>

<thinktime min="2" max="10" random="true"></thinktime>

<request><http url='http://192.168.96.134:8080/is-lnu-rest-api/api/sessions/current' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/sessions/current' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='http://192.168.96.134:9000/views/person/list_person.html' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='/views/directives/generalTable.html' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='http://192.168.96.134:8080/is-lnu-rest-api/api/persons?limit=10&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='http://192.168.96.134:8080/is-lnu-rest-api/api/persons/types?limit=300&amp;offset=0' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/gendertypes?limit=300&amp;offset=0' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/marriedtypes?limit=300&amp;offset=0' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/adminunits?adminUnitTypeId=6&amp;limit=300&amp;offset=0' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/persons/types?limit=300&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='/is-lnu-rest-api/api/gendertypes?limit=300&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='/is-lnu-rest-api/api/marriedtypes?limit=300&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='/is-lnu-rest-api/api/adminunits?adminUnitTypeId=6&amp;limit=300&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>

<thinktime min="2" max="10" random="true"></thinktime>

<request><http url='http://192.168.96.134:9000/views/enrolment/list_enrolments.html' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
<request><http url='http://192.168.96.134:8080/is-lnu-rest-api/api/enrolments?limit=10&amp;offset=0' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/enrolments?limit=10&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>

<thinktime min="2" max="10" random="true"></thinktime>

<request><http url='http://192.168.96.134:9000/views/dictionaries.html' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>

<thinktime min="2" max="10" random="true"></thinktime>

<request><http url='http://192.168.96.134:8080/is-lnu-rest-api/api/timeperiods/types?limit=300&amp;offset=0' version='1.1' method='OPTIONS'></http></request>
<request><http url='/is-lnu-rest-api/api/timeperiods/types?limit=300&amp;offset=0' version='1.1' method='GET'>
  <www_authenticate userid="admin" passwd="nimda" /></http></request>
</session>
 </sessions>
</tsung>